In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
from pandas import DataFrame,Series

In [34]:
ser=Series(['andaman','bombay','chennai'],index=list('abc'))

In [35]:
ser

a    andaman
b     bombay
c    chennai
dtype: object

In [37]:
ser.index

Index(['a', 'b', 'c'], dtype='object')

In [38]:
ser.values

array(['andaman', 'bombay', 'chennai'], dtype=object)

In [42]:
ser['c']

'chennai'

In [43]:
w=Series([87000,43000,30000,210000,40000],index=['ussr','ger','china','japan','usa'])

In [44]:
w

ussr      87000
ger       43000
china     30000
japan    210000
usa       40000
dtype: int64

In [45]:
w['japan']

210000

In [46]:
w>86000

ussr      True
ger      False
china    False
japan     True
usa      False
dtype: bool

In [47]:
w[w>86000]

ussr      87000
japan    210000
dtype: int64

In [52]:
a= w.to_dict()

In [53]:
a

{'ussr': 87000, 'ger': 43000, 'china': 30000, 'japan': 210000, 'usa': 40000}

In [57]:
'india' in w

False

In [58]:
'india' not in w

True

In [59]:
l=['ussr','ger','china','japan','usa','india']

In [60]:
l

['ussr', 'ger', 'china', 'japan', 'usa', 'india']

In [61]:
s=Series(a,index=l)

In [62]:
s

ussr      87000.0
ger       43000.0
china     30000.0
japan    210000.0
usa       40000.0
india         NaN
dtype: float64

In [70]:
s.isnull()

countries
ussr     False
ger      False
china    False
japan    False
usa      False
india     True
Name: two, dtype: bool

In [67]:
s.index.name='countries'

In [68]:
s

countries
ussr      87000.0
ger       43000.0
china     30000.0
japan    210000.0
usa       40000.0
india         NaN
Name: two, dtype: float64

In [65]:
s.name='two'

In [66]:
s

ussr      87000.0
ger       43000.0
china     30000.0
japan    210000.0
usa       40000.0
india         NaN
Name: two, dtype: float64

In [5]:
data=pd.read_clipboard() #clipboard is used to retrive copy data ie to paste the recent copied data
data

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,961,547,408,6,0.572,1960,NFC East
1,2,New England Patriots,957,537,411,9,0.566,1960,AFC East
2,3,Green Bay Packers,"1,409",778,593,38,0.565,1921,NFC North
3,4,Chicago Bears,"1,423",778,603,42,0.562,1920,NFC North
4,5,Miami Dolphins,857,472,381,4,0.553,1966,AFC East

In [6]:
data.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Division'],
      dtype='object')

In [26]:
df2=DataFrame(data,columns=['Team','Won','Lost'])

In [27]:
df2

                   Team  Won  Lost
0        Dallas Cowboys  547   408
1  New England Patriots  537   411
2     Green Bay Packers  778   593
3         Chicago Bears  778   603
4        Miami Dolphins  472   381

In [29]:
df2['Team']

0          Dallas Cowboys
1    New England Patriots
2       Green Bay Packers
3           Chicago Bears
4          Miami Dolphins
Name: Team, dtype: object

In [30]:
df2['Stadium']='vca'

In [31]:
df2

                   Team  Won  Lost Stadium
0        Dallas Cowboys  547   408     vca
1  New England Patriots  537   411     vca
2     Green Bay Packers  778   593     vca
3         Chicago Bears  778   603     vca
4        Miami Dolphins  472   381     vca

In [32]:
df2['Stadium']=[1,2,3,4,5]

In [33]:
df2

                   Team  Won  Lost  Stadium
0        Dallas Cowboys  547   408        1
1  New England Patriots  537   411        2
2     Green Bay Packers  778   593        3
3         Chicago Bears  778   603        4
4        Miami Dolphins  472   381        5

In [36]:
ser1=Series(['vca','vca Jamtha','Mohali'],index=[0,1,3])

In [37]:
ser1

0           vca
1    vca Jamtha
3        Mohali
dtype: object

In [38]:
df2['Stadium']=ser1

In [39]:
df2

                   Team  Won  Lost     Stadium
0        Dallas Cowboys  547   408         vca
1  New England Patriots  537   411  vca Jamtha
2     Green Bay Packers  778   593         NaN
3         Chicago Bears  778   603      Mohali
4        Miami Dolphins  472   381         NaN

In [40]:
del df2['Stadium']

In [41]:
df2

                   Team  Won  Lost
0        Dallas Cowboys  547   408
1  New England Patriots  537   411
2     Green Bay Packers  778   593
3         Chicago Bears  778   603
4        Miami Dolphins  472   381

In [48]:
df3=DataFrame({'Cities':['Chennai','Mumbai','Delhi'],'Population':[2000,3000,4000]},index=[1,2,3])

In [49]:
df3

    Cities  Population
1  Chennai        2000
2   Mumbai        3000
3    Delhi        4000

In [50]:
df3=DataFrame({'Cities':['Chennai','Mumbai','Delhi'],'Population':[2000,3000,4000]},index=['c','m','d'])

In [51]:
df3

    Cities  Population
c  Chennai        2000
m   Mumbai        3000
d    Delhi        4000

In [53]:
df3=DataFrame({'Cities':['Chennai','Mumbai','Delhi'],'Population':[2000,3000,4000]},index=list('CMD')) #using list
df3

    Cities  Population
C  Chennai        2000
M   Mumbai        3000
D    Delhi        4000

In [6]:
df = DataFrame(np.arange(0,25).reshape(5,5),columns=['col1','col2','col3','col4','col5'],index=list('abcde'))
df #for similar values

   col1  col2  col3  col4  col5
a     0     1     2     3     4
b     5     6     7     8     9
c    10    11    12    13    14
d    15    16    17    18    19
e    20    21    22    23    24

In [11]:
df['Name']=list('abcde')
df

   col1  col2  col3  col4  col5 Name
a     0     1     2     3     4    a
b     5     6     7     8     9    b
c    10    11    12    13    14    c
d    15    16    17    18    19    d
e    20    21    22    23    24    e